//#define PI 3.14159265358979323846 // 圆周率常量
//#include <stdio.h>
//int main() {
//	//实性字面量
//	double a = 3.14;
//	3.14, 52.4, 1.0;
//	1E6;
//	.55e4;
//
//	//字符字面量
//	char c = 'a';
//	'@', '#', '\'';
//
//	//字符串字面量
//	"123", "abc";
//
//	//整数字面量
//	int i = 123;
//	123, 0x7B, 0123, 0x7B, 0b1111011;
//	//浮点数字面量
//	float f = 3.14f;
//	3.14f, 52.4f, 1.0f;
//	1E6f;
//	.55e4f;
//
//	//符号常量
//	double r = 1.0;
//	double area = PI * r * r; // 使用圆周率常量计算圆的面积
//	printf("圆的面积: %f\n", area);
//}